Revit 2027 API
DirectContext3DHandleSettings(DirectContext3DHandleSettings) Constructor
 Constructs a copy of source object.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectContext3DHandleSettings(
	DirectContext3DHandleSettings other
)
Public Sub New (
	other As DirectContext3DHandleSettings
)
public:
DirectContext3DHandleSettings(
	DirectContext3DHandleSettings^ other
)
new :
        other : DirectContext3DHandleSettings -> DirectContext3DHandleSettings
Parameters
other DirectContext3DHandleSettings
 Source object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleSettings Class
DirectContext3DHandleSettings Overload
Autodesk.Revit.DB.DirectContext3D Namespace